Duet3D/Duet3Expansion/src/atmel/SAMD20_DFP/1.2.91/samd20/atdf/ATSAMD20J15.atdf
        <register name="ADDR" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="I2CS Address">
          <bitfield name="GENCEN" caption="General Call Address Enable" mask="0x1"/>
          <bitfield name="ADDR" caption="Address" mask="0xFE"/>
          <bitfield name="ADDRMASK" caption="Address Mask" mask="0xFE0000"/>
        </register>
        <register name="DATA" offset="0x18" rw="RW" size="1" initval="0x00" caption="I2CS Data">
          <bitfield name="DATA" caption="Data" mask="0xFF"/>
        </register>
      </register-group>
      <register-group name="SERCOM_SPI" caption="Serial Communication Interface - SPI Mode">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="SPI Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0x1C" values="SERCOM_SPI_CTRLA__MODE"/>
          <bitfield name="RUNSTDBY" caption="Run In Standby" mask="0x80"/>
          <bitfield name="IBON" caption="Immediate Buffer Overflow Notification" mask="0x100"/>
          <bitfield name="DOPO" caption="Data Out Pinout" mask="0x30000"/>
          <bitfield name="DIPO" caption="Data In Pinout" mask="0x300000"/>
          <bitfield name="FORM" caption="Frame Format" mask="0xF000000" values="SERCOM_SPI_CTRLA__FORM"/>
          <bitfield name="CPHA" caption="Clock Phase" mask="0x10000000"/>
          <bitfield name="CPOL" caption="Clock Polarity" mask="0x20000000"/>
          <bitfield name="DORD" caption="Data Order" mask="0x40000000"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="SPI Control B">
          <bitfield name="CHSIZE" caption="Character Size" mask="0x7"/>
          <bitfield name="PLOADEN" caption="Slave Data Preload Enable" mask="0x40"/>
          <bitfield name="AMODE" caption="Address Mode" mask="0xC000" values="SERCOM_SPI_CTRLB__AMODE"/>
          <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000"/>
        </register>
        <register name="DBGCTRL" offset="0x8" rw="RW" size="1" initval="0x00" caption="SPI Debug Control">
          <bitfield name="DBGSTOP" caption="Debug Stop Mode" mask="0x1"/>
        </register>
        <register name="BAUD" offset="0xA" rw="RW" size="1" initval="0x00" caption="SPI Baud Rate">
          <bitfield name="BAUD" caption="Baud Register" mask="0xFF"/>
        </register>
        <register name="INTENCLR" offset="0xC" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="SPI Interrupt Enable Clear">
          <bitfield name="DRE" caption="Data Register Empty Interrupt Enable" mask="0x1"/>
          <bitfield name="TXC" caption="Transmit Complete Interrupt Enable" mask="0x2"/>
          <bitfield name="RXC" caption="Receive Complete Interrupt Enable" mask="0x4"/>
        </register>
        <register name="INTENSET" offset="0xD" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="SPI Interrupt Enable Set">
          <bitfield name="DRE" caption="Data Register Empty Interrupt Enable" mask="0x1"/>
          <bitfield name="TXC" caption="Transmit Complete Interrupt Enable" mask="0x2"/>
          <bitfield name="RXC" caption="Receive Complete Interrupt Enable" mask="0x4"/>
        </register>
        <register name="INTFLAG" offset="0xE" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="SPI Interrupt Flag Status and Clear">
          <bitfield name="DRE" caption="Data Register Empty" mask="0x1"/>
          <bitfield name="TXC" caption="Transmit Complete" mask="0x2"/>
          <bitfield name="RXC" caption="Receive Complete" mask="0x4"/>
        </register>
        <register name="STATUS" offset="0x10" rw="RW" size="2" initval="0x0000" caption="SPI Status">
          <bitfield name="BUFOVF" caption="Buffer Overflow" mask="0x4"/>
          <bitfield name="SYNCBUSY" caption="Synchronization Busy" mask="0x8000"/>
        </register>
        <register name="ADDR" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="SPI Address">
          <bitfield name="ADDR" caption="Address" mask="0xFF"/>
          <bitfield name="ADDRMASK" caption="Address Mask" mask="0xFF0000"/>
        </register>
        <register name="DATA" offset="0x18" rw="RW" size="2" initval="0x0000" caption="SPI Data">
          <bitfield name="DATA" caption="Data" mask="0x1FF"/>
        </register>
      </register-group>
      <register-group name="SERCOM_USART" caption="Serial Communication Interface - USART Mode">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="USART Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0x1C" values="SERCOM_USART_CTRLA__MODE"/>
          <bitfield name="RUNSTDBY" caption="Run In Standby" mask="0x80"/>
          <bitfield name="IBON" caption="Immediate Buffer Overflow Notification" mask="0x100"/>
          <bitfield name="TXPO" caption="Transmit Data Pinout" mask="0x10000" values="SERCOM_USART_CTRLA__TXPO"/>
          <bitfield name="RXPO" caption="Receive Data Pinout" mask="0x300000" values="SERCOM_USART_CTRLA__RXPO"/>
          <bitfield name="FORM" caption="Frame Format" mask="0xF000000" values="SERCOM_USART_CTRLA__FORM"/>
          <bitfield name="CMODE" caption="Communication Mode" mask="0x10000000"/>
          <bitfield name="CPOL" caption="Clock Polarity" mask="0x20000000"/>
          <bitfield name="DORD" caption="Data Order" mask="0x40000000"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="USART Control B">
          <bitfield name="CHSIZE" caption="Character Size" mask="0x7"/>
          <bitfield name="SBMODE" caption="Stop Bit Mode" mask="0x40"/>
          <bitfield name="SFDE" caption="Start of Frame Detection Enable" mask="0x200"/>
          <bitfield name="PMODE" caption="Parity Mode" mask="0x2000"/>
          <bitfield name="TXEN" caption="Transmitter Enable" mask="0x10000"/>
          <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000"/>
        </register>
        <register name="DBGCTRL" offset="0x8" rw="RW" size="1" initval="0x00" caption="USART Debug Control">
          <bitfield name="DBGSTOP" caption="Debug Stop Mode" mask="0x1"/>
        </register>
